MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_sbs.c
10. Pin Remap functions :
   Several APIs are available to manage the ADC channel pin remapping features
   - Enable and disable the ADC channel pin remap:
    - This functionality is ensured respectively by HAL_SBS_EnableADCChannelPinRemap() function and
      HAL_SBS_DisableADCChannelPinRemap() function.
   - Check the ADC channel pin remapping status:
     - This functionality is ensured by HAL_SBS_IsEnabledADCChannelPinRemap() function.
  */
/**
  * @}
  */

/** @defgroup SBS_Configuration_Table SBS Configuration Table
  * @{
# Configuration inside the SBS driver

Config defines        | Description        | Default value | Note
----------------------| -------------------| ------------- | -----------------------------------------------------------
USE_HAL_SBS_MODULE    | from hal_conf.h    | 1U            | When set to 1, the HAL SBS module is enabled.
USE_ASSERT_DBG_PARAM  | from IDE           | None          | When defined, enable the params assert.
  */
/**
  * @}
  */

/* Private define ----------------------------------------------------------------------------------------------------*/
/** @defgroup SBS_Private_Constants SBS Private Constants
  * @{
  */
#define SBS_CCELL_MAX_DELAY_MS  50U   /*!< Max compensation cell timeout value (unit: milliseconds) */
#define HAL_SBS_CCELL_SIZE      0x0FU /*!< Max size of compensation cell code                       */
/**
  * @}
  */

/* Private macro -----------------------------------------------------------------------------------------------------*/
/** @defgroup SBS_Private_Macros SBS Private Macros
  * @{
  */

/*! Set floating point unit interrupts check macro */
#define IS_SBS_SET_FLOATING_POINT_IT(floating_point)     \
  ((((floating_point) & (HAL_SBS_IT_FPU_ALL)) != 0U)     \
   && (((floating_point) & (~HAL_SBS_IT_FPU_ALL)) == 0U))

/*! Get floating point unit interrupts check macro */
#define IS_SBS_GET_FLOATING_POINT_IT(floating_point) \
  (((floating_point) == (HAL_SBS_IT_FPU_IOC))        \
   || ((floating_point) == (HAL_SBS_IT_FPU_DZC))     \
   || ((floating_point) == (HAL_SBS_IT_FPU_UFC))     \
   || ((floating_point) == (HAL_SBS_IT_FPU_OFC))     \
   || ((floating_point) == (HAL_SBS_IT_FPU_IDC))     \
   || ((floating_point) == (HAL_SBS_IT_FPU_IXC)))

/*! TIM break inputs check macro */
#define IS_SBS_SET_TIM_BREAK_INPUTS(break_input)               \
  ((((break_input) & HAL_SBS_TIM_BREAK_INPUTS_ALL) != 0U)      \
   && (((break_input) & (~HAL_SBS_TIM_BREAK_INPUTS_ALL)) == 0U))

/*! TIM break inputs disable check macro */
#define IS_SBS_DISABLE_TIM_BREAK_INPUTS(break_input)     \
  ((break_input) == (HAL_SBS_FLASH_ECC_DOUBLE_ERROR))

/*! Get TIM break inputs check macro */
#define IS_SBS_GET_TIM_BREAK_INPUTS(break_input)       \
  (((break_input) == HAL_SBS_FLASH_ECC_DOUBLE_ERROR)   \
   || ((break_input) == HAL_SBS_PVD)                   \
   || ((break_input) == HAL_SBS_SRAM_ECC_DOUBLE_ERROR) \
   || ((break_input) == HAL_SBS_LOCKUP_OUT))

/*! Compensation cell check macro */
#define IS_SBS_CCELL(comp_cell) ((comp_cell) == HAL_SBS_CCELL_VDDIO)

/*! Compensation code check macro */
#define IS_SBS_CCELL_CODE(code_select)             \
  (((code_select) == HAL_SBS_CCELL_CODE_DEFAULT)   \
   || ((code_select) == HAL_SBS_CCELL_CODE_CUSTOM))

/*! Get compensation cell check macro */
#define IS_SBS_GET_CCELL(comp_cell)             \
  (((comp_cell) == HAL_SBS_CCELL_VDDIO))

/*! XMOS compensation cell check macro */
#define IS_SBS_XMOS_CCELL_CODE(pmos_code,nmos_code) \
  (((pmos_code) <= HAL_SBS_CCELL_SIZE)              \
   && ((nmos_code) <= HAL_SBS_CCELL_SIZE))

/*! Hide protection level check macro */
#define IS_SBS_HDP_LEVEL(level)        \
  (((level) == HAL_SBS_HDP_LEVEL_1)    \
   || ((level) == HAL_SBS_HDP_LEVEL_2) \
   || ((level) == HAL_SBS_HDP_LEVEL_3))
#if defined(SBS_NEXTHDPLCR_NEXTHDPL)

/*! Next Hide Protection Level Selection check macro */
#define IS_SBS_HDPOBK_SELECTION(hdp_obk_select)      \
  (((hdp_obk_select)   == HAL_SBS_HDP_OBK_LEVEL_0)   \
   || ((hdp_obk_select) == HAL_SBS_HDP_OBK_LEVEL_1)  \
   || ((hdp_obk_select) == HAL_SBS_HDP_OBK_LEVEL_2)  \
   || ((hdp_obk_select) == HAL_SBS_HDP_OBK_LEVEL_3))
#endif /* SBS_NEXTHDPLCR_NEXTHDPL */

/*! Macro to check the Core lock registers. */
#define IS_SBS_LOCK_CORE_REGS(core_regs) ((((core_regs) & (HAL_SBS_CORE_ALL_REGS)) != 0U) \
                                          && (((core_regs) & (~HAL_SBS_CORE_ALL_REGS)) == 0U))

/*! Macro to check the Core locked registers. */
#define IS_SBS_LOCKED_CORE_REGS(core_regs) (((core_regs) == HAL_SBS_CORE_VTOR_REG) \
                                            || ((core_regs) == HAL_SBS_CORE_MPU_REG))

#if defined(ETH1_BASE)
/*! ETH Interface selection check macro */
#define IS_SBS_ETHPHY_ITF(interface)             \
  (((interface) == HAL_SBS_ETHPHY_ITF_GMII_MII)   \
   || ((interface) == HAL_SBS_ETHPHY_ITF_RMII))

/*! ETH Polarity configuration check macro */
#define IS_SBS_ETHPHY_IT_POL(polarity)             \
  (((polarity) == HAL_SBS_ETHPHY_IT_POL_ACTIVE_HIGH)   \
   || ((polarity) == HAL_SBS_ETHPHY_IT_POL_ACTIVE_LOW))
#endif /* ETH1_BASE */

#if defined(SBS_PMCR_ADC1_IN2_REMAP)
/*! Set ADC channel pin remap check macro */
#define IS_SBS_SET_ADC_CHANNEL_PIN_REMAP(channel_pin_remap)   \
  ((((channel_pin_remap) & (HAL_SBS_REMAP_ADC_IN_ALL)) != 0U) \
   && (((channel_pin_remap) & (~HAL_SBS_REMAP_ADC_IN_ALL)) == 0U))

/*! Get ADC channel pin remap check macro */
#define IS_SBS_GET_ADC_CHANNEL_PIN_REMAP(channel_pin_remap) \
  (((channel_pin_remap) == HAL_SBS_REMAP_ADC_IN7_TO_PB1)    \
   || ((channel_pin_remap) == HAL_SBS_REMAP_ADC_IN6_TO_PB0) \
   || ((channel_pin_remap) == HAL_SBS_REMAP_ADC_IN5_TO_PC5) \
   || ((channel_pin_remap) == HAL_SBS_REMAP_ADC_IN2_TO_PC4))
#endif /* SBS_PMCR_ADC1_IN2_REMAP */
/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @addtogroup SBS_Exported_Functions
  * @{
  */

/** @addtogroup SBS_Exported_Functions_Group1
  * @{
  This section provides functions to manage the floating point interrupts:
  - Call HAL_SBS_EnableFPUIT() to enable the floating point unit interrupt(s).
  - Call HAL_SBS_DisableFPUIT() to disable the floating point unit interrupt(s).
  - Call HAL_SBS_IsEnabledFPUIT() to check if the floating point unit interrupt is enabled.
  */

/**
  * @brief  Enable the floating point unit interrupt(s).
  * @param  floating_point This parameter can be one or a combination of the following values:
  *         @arg @ref HAL_SBS_IT_FPU_IOC
  *         @arg @ref HAL_SBS_IT_FPU_DZC
  *         @arg @ref HAL_SBS_IT_FPU_UFC
  *         @arg @ref HAL_SBS_IT_FPU_OFC
  *         @arg @ref HAL_SBS_IT_FPU_IDC
  *         @arg @ref HAL_SBS_IT_FPU_IXC
  *         @arg @ref HAL_SBS_IT_FPU_ALL
  */
void HAL_SBS_EnableFPUIT(uint32_t floating_point)
{
  ASSERT_DBG_PARAM(IS_SBS_SET_FLOATING_POINT_IT(floating_point));

  LL_SBS_EnableFPUIT(floating_point);
}

/**
  * @brief  Disable the floating point unit interrupt(s).
  * @param  floating_point This parameter can be one or a combination of the following values:
  *         @arg @ref HAL_SBS_IT_FPU_IOC
  *         @arg @ref HAL_SBS_IT_FPU_DZC
  *         @arg @ref HAL_SBS_IT_FPU_UFC
  *         @arg @ref HAL_SBS_IT_FPU_OFC
  *         @arg @ref HAL_SBS_IT_FPU_IDC
  *         @arg @ref HAL_SBS_IT_FPU_IXC
  *         @arg @ref HAL_SBS_IT_FPU_ALL
  */
void HAL_SBS_DisableFPUIT(uint32_t floating_point)
{
  ASSERT_DBG_PARAM(IS_SBS_SET_FLOATING_POINT_IT(floating_point));

  LL_SBS_DisableFPUIT(floating_point);
}

/**
  * @brief  Check if the floating point unit interrupt is enabled.
  * @param  floating_point This parameter can be one of the following values:
  *         @arg @ref HAL_SBS_IT_FPU_IOC
  *         @arg @ref HAL_SBS_IT_FPU_DZC
  *         @arg @ref HAL_SBS_IT_FPU_UFC
  *         @arg @ref HAL_SBS_IT_FPU_OFC
  *         @arg @ref HAL_SBS_IT_FPU_IDC
  *         @arg @ref HAL_SBS_IT_FPU_IXC
  * @retval hal_sbs_it_fpu_status_t Floating point interrupt status.
  */
hal_sbs_it_fpu_status_t HAL_SBS_IsEnabledFPUIT(uint32_t floating_point)
{
  ASSERT_DBG_PARAM(IS_SBS_GET_FLOATING_POINT_IT(floating_point));

  return (hal_sbs_it_fpu_status_t)LL_SBS_IsEnabledFPUIT(floating_point);
}
/**
  * @}
  */

/** @addtogroup SBS_Exported_Functions_Group2
  * @{
  This section provides functions to manage the TIM break inputs:
  - Call HAL_SBS_EnableTIMBreakInputs() to enable the TIM break inputs.
  - Call HAL_SBS_DisableTIMBreakInputs() to disable the TIM break inputs.
  - Call HAL_SBS_IsEnabledTIMBreakInputs() to check if the TIM break inputs is enabled.
  */

/**
  * @brief  Enable the TIM break inputs.
  * @param  break_input This parameter can be one or a combination of the following values:
  *         @arg @ref HAL_SBS_FLASH_ECC_DOUBLE_ERROR
  *         @arg @ref HAL_SBS_PVD (*)
  *         @arg @ref HAL_SBS_SRAM_ECC_DOUBLE_ERROR (*)
  *         @arg @ref HAL_SBS_LOCKUP_OUT (*)
  * @note   (*) TIM break inputs disabling can only be done by a hardware reset.
  */
void HAL_SBS_EnableTIMBreakInputs(uint32_t break_input)
{
  ASSERT_DBG_PARAM(IS_SBS_SET_TIM_BREAK_INPUTS(break_input));

  LL_SBS_EnableTIMBreakInputs(break_input);
}

/**
  * @brief  Disable the TIM break inputs.
  * @param  break_input This parameter can be one or a combination of the following values:
  *         @arg @ref HAL_SBS_FLASH_ECC_DOUBLE_ERROR
  */
void HAL_SBS_DisableTIMBreakInputs(uint32_t break_input)
{
  ASSERT_DBG_PARAM(IS_SBS_DISABLE_TIM_BREAK_INPUTS(break_input));

  LL_SBS_DisableTIMBreakInputs(break_input);
}

/**
  * @brief  Check if the TIM break inputs is enabled.
  * @param  break_input This parameter can be one of the following values:
  *         @arg @ref HAL_SBS_FLASH_ECC_DOUBLE_ERROR
  *         @arg @ref HAL_SBS_PVD (*)
  *         @arg @ref HAL_SBS_SRAM_ECC_DOUBLE_ERROR (*)
  *         @arg @ref HAL_SBS_LOCKUP_OUT (*)
  * @retval hal_sbs_tim_break_input_status_t TIM break inputs status.
  */
hal_sbs_tim_break_input_status_t HAL_SBS_IsEnabledTIMBreakInputs(uint32_t break_input)
{
  ASSERT_DBG_PARAM(IS_SBS_GET_TIM_BREAK_INPUTS(break_input));

