MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_sbs.c
  return (hal_sbs_tim_break_input_status_t)LL_SBS_IsEnabledTIMBreakInputs(break_input);
}
/**
  * @}
  */

/** @addtogroup SBS_Exported_Functions_Group3
  * @{
  This section provides functions to control the compensation cell:
  - Call HAL_SBS_SetCompensationCellCodeSrc() to set the compensation cell code source.
  - Call HAL_SBS_GetCompensationCellCodeSrc() to get the compensation cell code source.
  - Call HAL_SBS_EnableCompensationCell() to enable the I/O compensation cell.
  - Call HAL_SBS_DisableCompensationCell() to disable the I/O compensation cell.
  - Call HAL_SBS_IsEnabledCompensationCell() to check if the I/O compensation cell is enabled.
  */

/**
  * @brief  Set the compensation cell code source.
  * @param  comp_cell This parameter has the following value:
  *         @arg @ref HAL_SBS_CCELL_VDDIO
  * @param  code_select This parameter can be one of the following values:
  *         @arg @ref HAL_SBS_CCELL_CODE_DEFAULT
  *         @arg @ref HAL_SBS_CCELL_CODE_CUSTOM
  */
void HAL_SBS_SetCompensationCellCodeSrc(uint32_t comp_cell, hal_sbs_ccell_code_src_t code_select)
{
  ASSERT_DBG_PARAM(IS_SBS_CCELL_CODE(code_select));
  ASSERT_DBG_PARAM(IS_SBS_CCELL(comp_cell));

  LL_SBS_SetCompensationCellCodeSrc(comp_cell, (uint32_t)code_select);
}

/**
  * @brief  Get the compensation cell code source.
  * @param  comp_cell This parameter can be one of the following values:
  *         @arg @ref HAL_SBS_CCELL_VDDIO
  * @retval hal_sbs_ccell_code_src_t Compensation cell code source.
  */
hal_sbs_ccell_code_src_t HAL_SBS_GetCompensationCellCodeSrc(uint32_t comp_cell)
{
  ASSERT_DBG_PARAM(IS_SBS_GET_CCELL(comp_cell));

  return (hal_sbs_ccell_code_src_t)LL_SBS_GetCompensationCellCodeSrc(comp_cell);
}

/**
  * @brief  Enable the I/O compensation cell.
  * @param  comp_cell This parameter has the following value:
  *         @arg @ref HAL_SBS_CCELL_VDDIO

  * @retval HAL_ERROR The compensation cell was not enabled within the allowed timeout period.
  * @retval HAL_OK    Compensation cell is enabled.
  */
hal_status_t HAL_SBS_EnableCompensationCell(uint32_t comp_cell)
{
  uint32_t timeout = (SBS_CCELL_MAX_DELAY_MS * (SystemCoreClock / 1000U)) + 1U;
  uint32_t comp_rdy;

  ASSERT_DBG_PARAM(IS_SBS_CCELL(comp_cell));

  LL_SBS_EnableCompensationCell(comp_cell);

  while (timeout > 0U)
  {
    comp_rdy = LL_SBS_IsActiveFlag_RDY1();

    if ((comp_rdy & comp_cell) == comp_cell)
    {
      return HAL_OK;
    }

    timeout--;
  }

  return HAL_ERROR;
}

/**
  * @brief  Disable the I/O compensation cell.
  * @param  comp_cell This parameter has the following value:
  *         @arg @ref HAL_SBS_CCELL_VDDIO
  */
void HAL_SBS_DisableCompensationCell(uint32_t comp_cell)
{
  ASSERT_DBG_PARAM(IS_SBS_CCELL(comp_cell));

  LL_SBS_DisableCompensationCell(comp_cell);
}

/**
  * @brief  Check if the I/O compensation cell is enabled.
  * @param  comp_cell This parameter can be one of the following values:
  *         @arg @ref HAL_SBS_CCELL_VDDIO
  * @retval hal_sbs_ccell_status_t I/O Compensation cell status.
  */
hal_sbs_ccell_status_t HAL_SBS_IsEnabledCompensationCell(uint32_t comp_cell)
{
  ASSERT_DBG_PARAM(IS_SBS_GET_CCELL(comp_cell));

  return ((hal_sbs_ccell_status_t)LL_SBS_IsEnabledCompensationCell(comp_cell));
}
/**
  * @}
  */

/** @addtogroup SBS_Exported_Functions_Group4
  * @{
  This section provides functions to manage the compensation cell:
  - Call HAL_SBS_GetPMOSCompensationCellValue() to get the PMOS compensation value of selected compensation cell.
  - Call HAL_SBS_GetNMOSCompensationCellValue() to get the NMOS compensation value of selected compensation cell.
  - Call HAL_SBS_SetConfigxMOSCompensationCellCode() to set the compensation cell code.
  - Call HAL_SBS_GetConfigxMOSCompensationCellCode() to get the compensation cell code.
  */

/**
  * @brief  Get the PMOS compensation value of the selected compensation cell.
  * @param  comp_cell This parameter can be one of the following values:
  *         @arg @ref HAL_SBS_CCELL_VDDIO
  * @retval uint32_t Value of the PMOS compensation cell.
  */
uint32_t HAL_SBS_GetPMOSCompensationCellValue(uint32_t comp_cell)
{
  ASSERT_DBG_PARAM(IS_SBS_GET_CCELL(comp_cell));

  return (LL_SBS_GetPMOSCompensationCellValue(comp_cell));
}

/**
  * @brief  Get the NMOS compensation value of the selected compensation cell.
  * @param  comp_cell This parameter can be one of the following values:
  *         @arg @ref HAL_SBS_CCELL_VDDIO
  * @retval uint32_t Value of the NMOS compensation cell.
  */
uint32_t HAL_SBS_GetNMOSCompensationCellValue(uint32_t comp_cell)
{
  ASSERT_DBG_PARAM(IS_SBS_GET_CCELL(comp_cell));

  return (LL_SBS_GetNMOSCompensationCellValue(comp_cell));
}

/**
  * @brief  Set the compensation cell code.
  * @param  comp_cell This parameter has the following value:
  *         @arg @ref HAL_SBS_CCELL_VDDIO
  * @param  pmos_code PMOS value to be applied to the compensation cell
  * @param  nmos_code NMOS value to be applied to the compensation cell
  */
void HAL_SBS_SetConfigxMOSCompensationCellCode(uint32_t comp_cell, uint32_t pmos_code, uint32_t nmos_code)
{
  ASSERT_DBG_PARAM(IS_SBS_CCELL(comp_cell));
  ASSERT_DBG_PARAM(IS_SBS_XMOS_CCELL_CODE(pmos_code, nmos_code));

  if ((comp_cell & HAL_SBS_CCELL_VDDIO) != 0U)
  {
    LL_SBS_SetxMOSVddIOCompensationCellCode(pmos_code, nmos_code);
  }
}

/**
  * @brief  Get the compensation cell code.
  * @param  comp_cell This parameter can be one of the following values:
  *         @arg @ref HAL_SBS_CCELL_VDDIO
  * @param  p_pmos_code Pointer to PMOS register of the selected compensation cell
  * @param  p_nmos_code Pointer to NMOS register of the selected compensation cell
  */
void HAL_SBS_GetConfigxMOSCompensationCellCode(uint32_t comp_cell, uint32_t *p_pmos_code, uint32_t *p_nmos_code)
{
  ASSERT_DBG_PARAM(IS_SBS_GET_CCELL(comp_cell));
  ASSERT_DBG_PARAM(p_pmos_code != NULL);
  ASSERT_DBG_PARAM(p_nmos_code != NULL);

  *p_pmos_code = (LL_SBS_GetPMOSCompensationCellCode(comp_cell) >> (STM32_POSITION_VAL(comp_cell << 1U) * 4U));
  *p_nmos_code = (LL_SBS_GetNMOSCompensationCellCode(comp_cell) >> (STM32_POSITION_VAL(comp_cell) * 4U));
}
/**
  * @}
  */

