MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_sbs.c
/** @addtogroup SBS_Exported_Functions_Group5
  * @{
  This section provides functions to enable/disable the NMI in case of double ECC error in FLASH Interface:
  - Call HAL_SBS_FLASH_EnableECCNMI() to enable the NMI in case of double ECC error in FLASH Interface.
  - Call HAL_SBS_FLASH_DisableECCNMI() to disable the NMI in case of double ECC error in FLASH Interface.
  - Call HAL_SBS_FLASH_IsEnabledECCNMI() to Check if the NMI is Enabled in case of double ECC error in
    FLASH Interface.
  */

/**
  * @brief  Enable the NMI in case of double ECC error in FLASH Interface.
  */
void HAL_SBS_FLASH_EnableECCNMI(void)
{
  LL_SBS_FLASH_EnableECCNMI();
}

/**
  * @brief  Disable the NMI in case of double ECC error in FLASH Interface.
  */
void HAL_SBS_FLASH_DisableECCNMI(void)
{
  LL_SBS_FLASH_DisableECCNMI();
}

/**
  * @brief  Check if the NMI is Enabled in case of double ECC error in FLASH Interface.
  * @retval State of bit (1 or 0).
  */
uint32_t HAL_SBS_FLASH_IsEnabledECCNMI(void)
{
  return (LL_SBS_FLASH_IsEnabledECCNMI());
}
/**
  * @}
  */

/** @addtogroup SBS_Exported_Functions_Group6
  * @{
  This section provides functions to set and get the HDP level value :
  - Call HAL_SBS_SetHDPLevelValue() to set the HDP level value.
  - Call HAL_SBS_GetHDPLevelValue() to get the HDP level value.
  - Call HAL_SBS_SetHDPOBKLevelValue() to set the OBK-HDP level value.
  - Call HAL_SBS_GetHDPOBKLevelValue() to get the OBK-HDP level value.
  */

/**
  * @brief  Set the HDP level value.
  * @param  value Value of the HDP level.
  *         This parameter can be one of the following values:
  *         @arg @ref  HAL_SBS_HDP_LEVEL_1
  *         @arg @ref  HAL_SBS_HDP_LEVEL_2
  *         @arg @ref  HAL_SBS_HDP_LEVEL_3
  * @retval HAL_ERROR Invalid HDP level value not set.
  * @retval HAL_OK    Valid HDP level value set correctly.
  */
hal_status_t HAL_SBS_SetHDPLevelValue(hal_sbs_hdp_level_value_t value)
{
  hal_sbs_hdp_level_value_t prev_hdp_level_value;

  ASSERT_DBG_PARAM(IS_SBS_HDP_LEVEL(value));

  prev_hdp_level_value = (hal_sbs_hdp_level_value_t)LL_SBS_GetHDPLevel();

  if (((value == HAL_SBS_HDP_LEVEL_2) && (prev_hdp_level_value == HAL_SBS_HDP_LEVEL_1)) \
      || ((value == HAL_SBS_HDP_LEVEL_3) && (prev_hdp_level_value == HAL_SBS_HDP_LEVEL_2)))
  {
    LL_SBS_IncrementHDPLevel();

    return HAL_OK;
  }

  return HAL_ERROR;
}

/**
  * @brief  Get the HDP level value.
  * @retval hal_sbs_hdp_level_value_t HDPL value.
  */
hal_sbs_hdp_level_value_t HAL_SBS_GetHDPLevelValue(void)
{
  return ((hal_sbs_hdp_level_value_t)LL_SBS_GetHDPLevel());
}
#if defined(SBS_NEXTHDPLCR_NEXTHDPL)

/**
  * @brief  Set the OBK-HDP level value.
  * @param  value Value of the increment to be added to HDPL value to generate the OBK-HDPL.
  *         This parameter can be one of the following values:
  *         @arg @ref  HAL_SBS_HDP_OBK_LEVEL_0 : HDPL (default value)
  *         @arg @ref  HAL_SBS_HDP_OBK_LEVEL_1 : HDPL + 1
  *         @arg @ref  HAL_SBS_HDP_OBK_LEVEL_2 : HDPL + 2
  *         @arg @ref  HAL_SBS_HDP_OBK_LEVEL_3 : HDPL + 3
  */
void HAL_SBS_SetHDPOBKLevelValue(hal_sbs_hdp_obk_level_value_t value)
{
  ASSERT_DBG_PARAM(IS_SBS_HDPOBK_SELECTION(value));

  LL_SBS_SetOBKHDPLevel((uint32_t)value);
}

/**
  * @brief  Get the OBK-HDP level value.
  * @retval hal_sbs_hdp_obk_level_value_t  OBK-HDP level value.
  */
hal_sbs_hdp_obk_level_value_t HAL_SBS_GetHDPOBKLevelValue(void)
{
  return ((hal_sbs_hdp_obk_level_value_t)LL_SBS_GetOBKHDPLevel());
}
#endif /* SBS_NEXTHDPLCR_NEXTHDPL */
/**
  * @}
  */

/** @addtogroup SBS_Exported_Functions_Group7
  * @{
  This section provides functions to manage the lock feature :
  - Call HAL_SBS_LockCoreRegisters() to lock the Core registers.
  - Call HAL_SBS_IsLockedCoreRegisters() to check if the Core registers is locked.
  */

/**
  * @brief Lock the Core registers.
  * @param core_regs This parameter can be one or a combination of the following values:
  *        @arg @ref HAL_SBS_CORE_VTOR_REG
  *        @arg @ref HAL_SBS_CORE_MPU_REG
  *        @arg @ref HAL_SBS_CORE_ALL_REGS
  * @note The unlock can only be done with a system reset
  */
void HAL_SBS_LockCoreRegisters(uint32_t core_regs)
{
  ASSERT_DBG_PARAM(IS_SBS_LOCK_CORE_REGS(core_regs));

  LL_SBS_CPU_LockRegisters(core_regs);
}

/**
  * @brief  Check if the Core registers are locked.
  * @param  core_regs This parameter can be one of the following values:
  *         @arg @ref HAL_SBS_CORE_VTOR_REG
  *         @arg @ref HAL_SBS_CORE_MPU_REG
  * @retval hal_sbs_core_reg_lock_status_t SBS Core registers lock status.
  */
hal_sbs_core_reg_lock_status_t HAL_SBS_IsLockedCoreRegisters(uint32_t core_regs)
{
  ASSERT_DBG_PARAM(IS_SBS_LOCKED_CORE_REGS(core_regs));

  return (hal_sbs_core_reg_lock_status_t)LL_SBS_CPU_IsLockedRegisters(core_regs);
}

/**
  * @}
  */

#if defined(ETH1_BASE)
/** @addtogroup SBS_Exported_Functions_Group9
  * @{
  This section provides functions to management the Ethernet features :
  - Call HAL_SBS_SetETHExternalPHYInterruptPolarity() to set the ethernet external PHY interrupt polarity.
  - Call HAL_SBS_GetETHExternalPHYInterruptPolarity() to get the ethernet external PHY interrupt polarity.
  - Call HAL_SBS_SetETHPHYInterface() to set the ethernet PHY interface.
  - Call HAL_SBS_GetETHPHYInterface() to get the ethernet PHY interface.
  - Call HAL_SBS_GetETHMACTXLPIStatus() to get the Ethernet TXLPI mode status.
  - Call HAL_SBS_GetETHPowerDownAck() to get the Ethernet power-down sequence acknowledge.
  */

/**
  * @brief  Set the ethernet external PHY interrupt polarity.
  * @param  ethx ETH1 instance.
  * @param  it_pol interrupt polarity to set based on @ref hal_sbs_ethphy_it_pol_active_level_t
  */
void HAL_SBS_SetETHExternalPHYInterruptPolarity(const ETH_TypeDef *ethx,
                                                hal_sbs_ethphy_it_pol_active_level_t it_pol)
{
  ASSERT_DBG_PARAM(IS_SBS_ETHPHY_IT_POL(it_pol));

  STM32_UNUSED(ethx);
  LL_SBS_SetETHExternalPHYInterruptPolarity(LL_SBS_PERIPH_ETH1, (uint32_t)it_pol);
}

/**
  * @brief  Get the ethernet external PHY interrupt polarity.
  * @param  ethx ETH1 instance.
  * @retval Ethernet interrupt polarity based on @ref hal_sbs_ethphy_it_pol_active_level_t
  */
hal_sbs_ethphy_it_pol_active_level_t HAL_SBS_GetETHExternalPHYInterruptPolarity(ETH_TypeDef *ethx)
{
  STM32_UNUSED(ethx);
  return (hal_sbs_ethphy_it_pol_active_level_t)LL_SBS_GetETHExternalPHYInterruptPolarity(LL_SBS_PERIPH_ETH1);
}

/**
  * @brief  Set the ethernet PHY interface.
  * @param  ethx ETH1 instance.
  * @param  phy_int phy interface to set based on @ref hal_sbs_ethphy_itf_t
  */
void HAL_SBS_SetETHPHYInterface(const ETH_TypeDef *ethx, hal_sbs_ethphy_itf_t phy_int)
{
  ASSERT_DBG_PARAM(IS_SBS_ETHPHY_ITF(phy_int));

  STM32_UNUSED(ethx);
  LL_SBS_SetETHPHYInterface(LL_SBS_PERIPH_ETH1, (uint32_t)phy_int);
}

/**
  * @brief  Get the ethernet PHY interface.
  * @param  ethx ETH1 instance.
  * @retval Ethernet phy interface based on @ref hal_sbs_ethphy_itf_t
  */
hal_sbs_ethphy_itf_t HAL_SBS_GetETHPHYInterface(ETH_TypeDef *ethx)
{
  STM32_UNUSED(ethx);
  return (hal_sbs_ethphy_itf_t)LL_SBS_GetETHPHYInterface(LL_SBS_PERIPH_ETH1);
}

/**
  * @brief  Get the Ethernet TXLPI mode status.
  * @param  ethx ETH1 instance.
  * @retval Ethernet TXLPI mode status based on @ref hal_sbs_ethmac_txlpi_status_t
  */
hal_sbs_ethmac_txlpi_status_t HAL_SBS_GetETHMACTXLPIStatus(ETH_TypeDef *ethx)
{
  STM32_UNUSED(ethx);
  return (hal_sbs_ethmac_txlpi_status_t)LL_SBS_GetETHMACTXLPIStatus(LL_SBS_PERIPH_ETH1);
}

/**
  * @brief  Get the Ethernet power-down sequence acknowledge.
  * @param  ethx ETH1 instance.
  * @retval Ethernet power-down sequence acknowledge based on @ref hal_sbs_eth_power_down_seq_ack_t
  */
hal_sbs_eth_power_down_seq_ack_t HAL_SBS_GetETHPowerDownAck(ETH_TypeDef *ethx)
{
  STM32_UNUSED(ethx);
  return (hal_sbs_eth_power_down_seq_ack_t)LL_SBS_GetETHPowerDownAck(LL_SBS_PERIPH_ETH1);
}
/**
  * @}
  */
#endif /* ETH1_BASE */

#if defined(SBS_PMCR_ADC1_IN2_REMAP)
/** @addtogroup SBS_Exported_Functions_Group10
  * @{
  This section provides functions to management the ADC channel pin remap feature :
  - Call HAL_SBS_EnableADCChannelPinRemap() to enable the ADC channel pin remap.
  - Call HAL_SBS_DisableADCChannelPinRemap() to disable the ADC channel pin remap.
  - Call HAL_SBS_IsEnabledADCChannelPinRemap() to check the ADC channel pin remapping status.
  */

/**
  * @brief Enable the ADC channel pin remap.
  * @param adc_channel_pin_remap This parameter can be one or a combination of the following values:
  *        @arg @ref HAL_SBS_REMAP_ADC_IN7_TO_PB1
  *        @arg @ref HAL_SBS_REMAP_ADC_IN6_TO_PB0
  *        @arg @ref HAL_SBS_REMAP_ADC_IN5_TO_PC5
  *        @arg @ref HAL_SBS_REMAP_ADC_IN2_TO_PC4
  *        @arg @ref HAL_SBS_REMAP_ADC_IN_ALL
  */
void HAL_SBS_EnableADCChannelPinRemap(uint32_t adc_channel_pin_remap)
{
  ASSERT_DBG_PARAM(IS_SBS_SET_ADC_CHANNEL_PIN_REMAP(adc_channel_pin_remap));

  LL_SBS_EnableADCChannelPinRemap(adc_channel_pin_remap);
}

/**
  * @brief Disable the ADC channel pin remap.
  * @param adc_channel_pin_remap This parameter can be one or a combination of the following values:
  *        @arg @ref HAL_SBS_REMAP_ADC_IN7_TO_PB1
  *        @arg @ref HAL_SBS_REMAP_ADC_IN6_TO_PB0
  *        @arg @ref HAL_SBS_REMAP_ADC_IN5_TO_PC5
  *        @arg @ref HAL_SBS_REMAP_ADC_IN2_TO_PC4
  *        @arg @ref HAL_SBS_REMAP_ADC_IN_ALL
  */
void HAL_SBS_DisableADCChannelPinRemap(uint32_t adc_channel_pin_remap)
{
  ASSERT_DBG_PARAM(IS_SBS_SET_ADC_CHANNEL_PIN_REMAP(adc_channel_pin_remap));

  LL_SBS_DisableADCChannelPinRemap(adc_channel_pin_remap);
}

/**
  * @brief  Check if the ADC channel pin remap is enabled or disabled.
  * @param  adc_channel_pin_remap This parameter can be one of the following values:
  *         @arg @ref HAL_SBS_REMAP_ADC_IN7_TO_PB1
  *         @arg @ref HAL_SBS_REMAP_ADC_IN6_TO_PB0
  *         @arg @ref HAL_SBS_REMAP_ADC_IN5_TO_PC5
  *         @arg @ref HAL_SBS_REMAP_ADC_IN2_TO_PC4
  * @retval hal_sbs_adc_channel_pin_remap_status_t ADC channel pin remapping status.
  */
hal_sbs_adc_channel_pin_remap_status_t HAL_SBS_IsEnabledADCChannelPinRemap(uint32_t adc_channel_pin_remap)
{
  ASSERT_DBG_PARAM(IS_SBS_GET_ADC_CHANNEL_PIN_REMAP(adc_channel_pin_remap));

  return (hal_sbs_adc_channel_pin_remap_status_t)LL_SBS_IsEnabledADCChannelPinRemap(adc_channel_pin_remap);
}
/**
  * @}
  */
#endif /* SBS_PMCR_ADC1_IN2_REMAP */

/**
  * @}
  */

/**
  * @}
  */
#endif /* USE_HAL_SBS_MODULE */
#endif /* SBS */

/**
  * @}
  */
